#include <iostream>
using namespace std;
int main() {
 setlocale(LC_ALL, "RU");
cout << "-------------------------------------------------------------------------------------" << endl;

 cout << "A" << endl;
 cout << "(5 2 0 10)" << endl;
 cout << "(3 5 2 5)" << endl;
 cout << "(20 0 0 0)" << endl;
 cout << endl;
 cout << "B" << endl;
 cout << "(1,20 0,50)" << endl;
 cout << "(2,80 0,40)" << endl;
 cout << "(5,00 1,00)" << endl;
 cout << "(2,00 1,50)" << endl;

 cout << "-------------------------------------------------------------------------------------" << endl;
 
cout << "(1,20  2,80  5,00 2,00 )" << endl;
cout << " B ^ T "<< endl;
cout << "(0,50 0,40 1,00 1,50 )" << endl;
 cout << "-------------------------------------------------------------------------------------" << endl;

 cout << endl << endl;
 cout << "A * B = C" << endl;
 cout << "(31,6 18,3 )" << endl;
 cout << "(37,6 13)" << endl;
 cout << "(24  10)" << endl;
 cout << endl << endl;
 cout << "-------------------------------------------------------------------------------------" << endl;

 cout << "1. Больше  выручка у 2-го продавца (37,6)" << endl;
 cout << "1.2  Меньше  выручка  у 3-го продавца (24)" << endl;

 cout << "2. Больше  комиссионных  у 1-го продавца (18,3)" << endl;
 cout << "2.2  Меньше  комиссионных  у 3-го продавца (10)" << endl;

 cout << "3. общая сумма  31,6 + 37,6 + 24 = 93,2" << endl;

 cout << "4. Общая сумма для всех продавцов составит 18,3 + 13 + 10 = 41,3" << endl;

 cout << "5. сумма всех денег 134,5";
  cout << "-------------------------------------------------------------------------------------" << endl;

}